In [1]:
import findspark
findspark.init()

import pandas as pd
import pyspark

In [2]:
from pyspark.sql import SparkSession
from pyspark.sql.functions import *
from pyspark.sql.types import StringType

### Crear la sesión de Spark

In [3]:
#Creamos un objeto de spark session
spark = SparkSession.builder.appName("pysparkdf").getOrCreate()

### Crear el DataFrame

### 1. Crear un DataFrame con datos de personas, que incluya nombre, edad y ciudad de residencia.

Utilizar el siguiente esquema:\
data = [("Alice", 25, "New York"),
        ("Bob", 30, "Los Angeles"),
        ("Charlie", 22, "Chicago")]

In [4]:
data = [("Alice", 25, "New York"),
        ("Bob", 30, "Los Angeles"),
        ("Charlie", 22, "Chicago"),
        ("Tarra",78,"Dixon"),
        ("Rhett",39,"New York"),
        ("Morie",94,"New York"),
        ("Linus",15,"New York"),
        ("Ringo",52,"New York"),
        ("Sybille",98,"New York"),
        ("Hedvig",25,"New York"),
        ("Ara",44,"New York"),
        ("Cos",58,"Los Angeles"),
        ("Jillian",90,"Chicago"),
        ("Lulita",68,"Los Angeles"),
        ("Sherman",62,"Los Angeles"),
        ("Danyelle",70,"Dixon"),
        ("Charlie",59,"Chicago"),
        ("Vanessa",31,"Los Angeles"),
        ("Syman",51,"Los Angeles"),
        ("Avram",90,"Chicago"),
        ("Stephani",46,"Dixon"),
        ("Dot",33,"Chicago"),
        ("Bob",60,"Chive"),
        ("Bob",39,"Chicago"),
        ("Bob",94,"Los Angeles"),
        ("Katha",22,"Nevada"),
        ("Gasparo",37,"Los Angeles"), 
        ("Agustin",68,"Los Angeles"),
        ("Desiri",50,"Dixon"),
        ("Leroy",92,"Chicago"),
        ("Elvina",65,"New York"),
        ("Tatiania",24,"New York"),
        ("Livy",45,"New York"),
        ("Shanie",33,"New York"),
        ("Adolpho",54,"New York"),
        ("Suzette",77,"New York"),
        ("Charlie",70,"Los Angeles"),
        ("Keslie",81,"Los Angeles"),
        ("Markus",62,"Los Angeles"),
        ("Peri",60,"Dixon"),
        ("Philis",85,"Chicago"), 
        ("Bob",89,"Chicago"),
        ("Anestassia",19,"Chicago"),
        ("Kendrick",70,"Chicago"),
        ("Ileana",95,"Dixon"),
        ("Francklyn",76,"Westport"),
        ("Nickola",15,"Dixon"),
        ("Vanessa",70,"Algoma"),
        ("Kristal",54,"New York"),
        ("Anestassia",30,"New York"),
        ("Charlie",18,"New York"),
        ("Emelina",27,"New York"),
        ("Ibrahim",15,"New York"),
        ("Vanessa",21,"New York"),
        ("Lainey",30,"Ronald Regan"), 
        ("Dehlia",74,"Dixon"),
        ("Timothy",12,"Chicago"),
        ("Humfried",13,"Chicago"),
        ("Saxe",18,"Arrowood"),
        ("Shirline",23,"Lillian"),
        ("Vanessa",77,"Dixon"),
        ("Fawne",39,"Chicago"),
        ("Kellen",68,"Nevada"),
        ("Gabriela",35,"Chicago"),
        ("Edee",72,"New York"),
        ("Vanessa",97,"New York"),
        ("Vikky",44,"New York"),
        ("Bob",95,"New York"), 
        ("Nananne",77,"Los Angeles"),
        ("Willabella",38,"Weeping Birch"), 
        ("Cosetta",27,"Chicago"),
        ("Rena",72,"New York"),
        ("Charlie",26,"New York"),
        ("Charlie",51,"New York"),
        ("Vanessa",65,"Springs"),
        ("Lizbeth",68,"Weeping Birch"), 
        ("Charita",28,"Springs"),
        ("Kathryne",60,"Los Angeles"),
        ("Morie",10,"Los Angeles"), 
        ("Finn",79,"Los Angeles"),
        ("Darryl",74,"Los Angeles"),
        ("Vanessa",60,"Chicago"),
        ("Amie",10,"Dixon"),
        ("Scotty",72,"Wayridge"),
        ("Charisse",53,"Pearson"),
        ("Francesca",54,"Dixon"),
        ("Zebulon",55,"Shelley"),
        ("Bob",83,"Chicago"), 
        ("Caro",96,"Chicago"),
        ("Hayden",13,"Chicago"),
        ("Mavis",67,"Chicago"),
        ("Charlie",10,"Los Angeles"), 
        ("Cesya",51,"Los Angeles"),
        ("Cristobal",40,"Chicago"),
        ("Vanessa",14,"Chicago"),
        ("Matilda",50,"Los Angeles"),
        ("Hasty",36,"New York"),
        ("Nerte",13,"New York"),
        ("Ashien",17,"Chicago"),
        ("Jenn",31,"Los Angeles"),
        ("Vanessa",94,"Los Angeles"),
        ("Ashlee",92,"Los Angeles"),
        ("Bob",59,"New York")]

In [5]:
df = spark.createDataFrame(data, ["Nombre", "Edad", "Ciudad"])
df.show()

+--------+----+-----------+
|  Nombre|Edad|     Ciudad|
+--------+----+-----------+
|   Alice|  25|   New York|
|     Bob|  30|Los Angeles|
| Charlie|  22|    Chicago|
|   Tarra|  78|      Dixon|
|   Rhett|  39|   New York|
|   Morie|  94|   New York|
|   Linus|  15|   New York|
|   Ringo|  52|   New York|
| Sybille|  98|   New York|
|  Hedvig|  25|   New York|
|     Ara|  44|   New York|
|     Cos|  58|Los Angeles|
| Jillian|  90|    Chicago|
|  Lulita|  68|Los Angeles|
| Sherman|  62|Los Angeles|
|Danyelle|  70|      Dixon|
| Charlie|  59|    Chicago|
| Vanessa|  31|Los Angeles|
|   Syman|  51|Los Angeles|
|   Avram|  90|    Chicago|
+--------+----+-----------+
only showing top 20 rows

### 2. Mostrar solo los nombres de las personas del DataFrame.

In [6]:
df.select("Nombre").show()

+--------+
|  Nombre|
+--------+
|   Alice|
|     Bob|
| Charlie|
|   Tarra|
|   Rhett|
|   Morie|
|   Linus|
|   Ringo|
| Sybille|
|  Hedvig|
|     Ara|
|     Cos|
| Jillian|
|  Lulita|
| Sherman|
|Danyelle|
| Charlie|
| Vanessa|
|   Syman|
|   Avram|
+--------+
only showing top 20 rows

# 3. Filtrar personas cuya edad sea mayor o igual a 25.

In [7]:
df.filter(df.Edad >= 25).show()

+--------+----+-----------+
|  Nombre|Edad|     Ciudad|
+--------+----+-----------+
|   Alice|  25|   New York|
|     Bob|  30|Los Angeles|
|   Tarra|  78|      Dixon|
|   Rhett|  39|   New York|
|   Morie|  94|   New York|
|   Ringo|  52|   New York|
| Sybille|  98|   New York|
|  Hedvig|  25|   New York|
|     Ara|  44|   New York|
|     Cos|  58|Los Angeles|
| Jillian|  90|    Chicago|
|  Lulita|  68|Los Angeles|
| Sherman|  62|Los Angeles|
|Danyelle|  70|      Dixon|
| Charlie|  59|    Chicago|
| Vanessa|  31|Los Angeles|
|   Syman|  51|Los Angeles|
|   Avram|  90|    Chicago|
|Stephani|  46|      Dixon|
|     Dot|  33|    Chicago|
+--------+----+-----------+
only showing top 20 rows

# 4. Agregar una nueva columna "Pais" con un valor constante para todas las filas.

In [8]:
data = df.withColumn('Pais', lit('Estados Unidos'))
data.show()

+--------+----+-----------+--------------+
|  Nombre|Edad|     Ciudad|          Pais|
+--------+----+-----------+--------------+
|   Alice|  25|   New York|Estados Unidos|
|     Bob|  30|Los Angeles|Estados Unidos|
| Charlie|  22|    Chicago|Estados Unidos|
|   Tarra|  78|      Dixon|Estados Unidos|
|   Rhett|  39|   New York|Estados Unidos|
|   Morie|  94|   New York|Estados Unidos|
|   Linus|  15|   New York|Estados Unidos|
|   Ringo|  52|   New York|Estados Unidos|
| Sybille|  98|   New York|Estados Unidos|
|  Hedvig|  25|   New York|Estados Unidos|
|     Ara|  44|   New York|Estados Unidos|
|     Cos|  58|Los Angeles|Estados Unidos|
| Jillian|  90|    Chicago|Estados Unidos|
|  Lulita|  68|Los Angeles|Estados Unidos|
| Sherman|  62|Los Angeles|Estados Unidos|
|Danyelle|  70|      Dixon|Estados Unidos|
| Charlie|  59|    Chicago|Estados Unidos|
| Vanessa|  31|Los Angeles|Estados Unidos|
|   Syman|  51|Los Angeles|Estados Unidos|
|   Avram|  90|    Chicago|Estados Unidos|
+--------+----+-----------+--------------+
only showing top 20 rows

# 5. Calcular el promedio de edad de todas las personas.

In [9]:
data.select(mean("Edad")).show()

+-----------------+
|        avg(Edad)|
+-----------------+
|51.83495145631068|
+-----------------+

# 6. Ordenar el DataFrame por edad en orden descendente.

In [10]:
data = data.sort("Edad")
data.show()

+----------+----+-----------+--------------+
|    Nombre|Edad|     Ciudad|          Pais|
+----------+----+-----------+--------------+
|      Amie|  10|      Dixon|Estados Unidos|
|     Morie|  10|Los Angeles|Estados Unidos|
|   Charlie|  10|Los Angeles|Estados Unidos|
|   Timothy|  12|    Chicago|Estados Unidos|
|    Hayden|  13|    Chicago|Estados Unidos|
|  Humfried|  13|    Chicago|Estados Unidos|
|     Nerte|  13|   New York|Estados Unidos|
|   Vanessa|  14|    Chicago|Estados Unidos|
|   Nickola|  15|      Dixon|Estados Unidos|
|     Linus|  15|   New York|Estados Unidos|
|   Ibrahim|  15|   New York|Estados Unidos|
|    Ashien|  17|    Chicago|Estados Unidos|
|   Charlie|  18|   New York|Estados Unidos|
|      Saxe|  18|   Arrowood|Estados Unidos|
|Anestassia|  19|    Chicago|Estados Unidos|
|   Vanessa|  21|   New York|Estados Unidos|
|     Katha|  22|     Nevada|Estados Unidos|
|   Charlie|  22|    Chicago|Estados Unidos|
|  Shirline|  23|    Lillian|Estados Unidos|
|  Tatiania|  24|   New York|Estados Unidos|
+----------+----+-----------+--------------+
only showing top 20 rows

# 7. Agrupar por ciudad y calcular la cantidad de personas en cada ciudad.

In [11]:
data.groupBy("Ciudad").count().show(truncate=False)

+-------------+-----+
|Ciudad       |count|
+-------------+-----+
|Los Angeles  |23   |
|Chicago      |24   |
|Dixon        |11   |
|New York     |30   |
|Chive        |1    |
|Nevada       |2    |
|Algoma       |1    |
|Westport     |1    |
|Ronald Regan |1    |
|Arrowood     |1    |
|Lillian      |1    |
|Weeping Birch|2    |
|Springs      |2    |
|Shelley      |1    |
|Pearson      |1    |
|Wayridge     |1    |
+-------------+-----+

# 8. Renombrar la columna "Nombre" a "NombreCompleto".

In [12]:
datacolrenamed = data.withColumnRenamed("Nombre","NombreCompleto")
datacolrenamed.show()

+--------------+----+-----------+--------------+
|NombreCompleto|Edad|     Ciudad|          Pais|
+--------------+----+-----------+--------------+
|         Morie|  10|Los Angeles|Estados Unidos|
|       Charlie|  10|Los Angeles|Estados Unidos|
|          Amie|  10|      Dixon|Estados Unidos|
|       Timothy|  12|    Chicago|Estados Unidos|
|        Hayden|  13|    Chicago|Estados Unidos|
|      Humfried|  13|    Chicago|Estados Unidos|
|         Nerte|  13|   New York|Estados Unidos|
|       Vanessa|  14|    Chicago|Estados Unidos|
|       Ibrahim|  15|   New York|Estados Unidos|
|         Linus|  15|   New York|Estados Unidos|
|       Nickola|  15|      Dixon|Estados Unidos|
|        Ashien|  17|    Chicago|Estados Unidos|
|          Saxe|  18|   Arrowood|Estados Unidos|
|       Charlie|  18|   New York|Estados Unidos|
|    Anestassia|  19|    Chicago|Estados Unidos|
|       Vanessa|  21|   New York|Estados Unidos|
|         Katha|  22|     Nevada|Estados Unidos|
|       Charlie|  22|    Chicago|Estados Unidos|
|      Shirline|  23|    Lillian|Estados Unidos|
|      Tatiania|  24|   New York|Estados Unidos|
+--------------+----+-----------+--------------+
only showing top 20 rows

# 9. Eliminar la columna "Edad" del DataFrame.

In [13]:
newdf = data.drop("Edad")
newdf.show()

+----------+-----------+--------------+
|    Nombre|     Ciudad|          Pais|
+----------+-----------+--------------+
|     Morie|Los Angeles|Estados Unidos|
|      Amie|      Dixon|Estados Unidos|
|   Charlie|Los Angeles|Estados Unidos|
|   Timothy|    Chicago|Estados Unidos|
|    Hayden|    Chicago|Estados Unidos|
|  Humfried|    Chicago|Estados Unidos|
|     Nerte|   New York|Estados Unidos|
|   Vanessa|    Chicago|Estados Unidos|
|   Nickola|      Dixon|Estados Unidos|
|   Ibrahim|   New York|Estados Unidos|
|     Linus|   New York|Estados Unidos|
|    Ashien|    Chicago|Estados Unidos|
|   Charlie|   New York|Estados Unidos|
|      Saxe|   Arrowood|Estados Unidos|
|Anestassia|    Chicago|Estados Unidos|
|   Vanessa|   New York|Estados Unidos|
|   Charlie|    Chicago|Estados Unidos|
|     Katha|     Nevada|Estados Unidos|
|  Shirline|    Lillian|Estados Unidos|
|  Tatiania|   New York|Estados Unidos|
+----------+-----------+--------------+
only showing top 20 rows

# 10. Realizar una consulta SQL en el DataFrame para seleccionar personas mayores de 20 años.

In [14]:
# Register DataFrame as users
data.createOrReplaceTempView("users")

# Execute SQL-Like query.
spark.sql("select * from users s where s.Edad > 20").show()

+----------+----+------------+--------------+
|    Nombre|Edad|      Ciudad|          Pais|
+----------+----+------------+--------------+
|   Vanessa|  21|    New York|Estados Unidos|
|     Katha|  22|      Nevada|Estados Unidos|
|   Charlie|  22|     Chicago|Estados Unidos|
|  Shirline|  23|     Lillian|Estados Unidos|
|  Tatiania|  24|    New York|Estados Unidos|
|    Hedvig|  25|    New York|Estados Unidos|
|     Alice|  25|    New York|Estados Unidos|
|   Charlie|  26|    New York|Estados Unidos|
|   Emelina|  27|    New York|Estados Unidos|
|   Cosetta|  27|     Chicago|Estados Unidos|
|   Charita|  28|     Springs|Estados Unidos|
|Anestassia|  30|    New York|Estados Unidos|
|       Bob|  30| Los Angeles|Estados Unidos|
|    Lainey|  30|Ronald Regan|Estados Unidos|
|   Vanessa|  31| Los Angeles|Estados Unidos|
|      Jenn|  31| Los Angeles|Estados Unidos|
|    Shanie|  33|    New York|Estados Unidos|
|       Dot|  33|     Chicago|Estados Unidos|
|  Gabriela|  35|     Chicago|Estados Unidos|
|     Hasty|  36|    New York|Estados Unidos|
+----------+----+------------+--------------+
only showing top 20 rows

# 11. Calcular la suma total de todas las edades.

In [15]:
spark.sql("select sum(Edad) from users").show()

+---------+
|sum(Edad)|
+---------+
|     5339|
+---------+

# 12. Calcular la edad mínima y máxima de todas las personas.

In [16]:
spark.sql("select min(Edad) as edad_minima, max(Edad) as edad_maxima from users").show()

+-----------+-----------+
|edad_minima|edad_maxima|
+-----------+-----------+
|         10|         98|
+-----------+-----------+

# 13. Filtrar personas cuya ciudad de residencia sea "Chicago" y edad sea menor de 30.

In [17]:
data.filter((data.Ciudad == "Chicago") & (data.Edad < 30)).show()

+----------+----+-------+--------------+
|    Nombre|Edad| Ciudad|          Pais|
+----------+----+-------+--------------+
|   Timothy|  12|Chicago|Estados Unidos|
|    Hayden|  13|Chicago|Estados Unidos|
|  Humfried|  13|Chicago|Estados Unidos|
|   Vanessa|  14|Chicago|Estados Unidos|
|    Ashien|  17|Chicago|Estados Unidos|
|Anestassia|  19|Chicago|Estados Unidos|
|   Charlie|  22|Chicago|Estados Unidos|
|   Cosetta|  27|Chicago|Estados Unidos|
+----------+----+-------+--------------+

# 14. Agregar una nueva columna "EdadDuplicada" que contenga el doble de la edad.

In [18]:
newdata = data.withColumn("EdadDuplicada", data.Edad*2)
newdata.show()

+----------+----+-----------+--------------+-------------+
|    Nombre|Edad|     Ciudad|          Pais|EdadDuplicada|
+----------+----+-----------+--------------+-------------+
|   Charlie|  10|Los Angeles|Estados Unidos|           20|
|     Morie|  10|Los Angeles|Estados Unidos|           20|
|      Amie|  10|      Dixon|Estados Unidos|           20|
|   Timothy|  12|    Chicago|Estados Unidos|           24|
|    Hayden|  13|    Chicago|Estados Unidos|           26|
|  Humfried|  13|    Chicago|Estados Unidos|           26|
|     Nerte|  13|   New York|Estados Unidos|           26|
|   Vanessa|  14|    Chicago|Estados Unidos|           28|
|     Linus|  15|   New York|Estados Unidos|           30|
|   Nickola|  15|      Dixon|Estados Unidos|           30|
|   Ibrahim|  15|   New York|Estados Unidos|           30|
|    Ashien|  17|    Chicago|Estados Unidos|           34|
|      Saxe|  18|   Arrowood|Estados Unidos|           36|
|   Charlie|  18|   New York|Estados Unidos|           36|
|Anestassia|  19|    Chicago|Estados Unidos|           38|
|   Vanessa|  21|   New York|Estados Unidos|           42|
|     Katha|  22|     Nevada|Estados Unidos|           44|
|   Charlie|  22|    Chicago|Estados Unidos|           44|
|  Shirline|  23|    Lillian|Estados Unidos|           46|
|  Tatiania|  24|   New York|Estados Unidos|           48|
+----------+----+-----------+--------------+-------------+
only showing top 20 rows

# 15. Convertir todas las edades en años a meses.

In [19]:
newdatameses = newdata.withColumn("EdadDuplicadaMeses", newdata.EdadDuplicada*12)
newdatameses = newdatameses.withColumn("EdadMeses", newdata.Edad*12)
newdatameses.show()

+----------+----+-----------+--------------+-------------+------------------+---------+
|    Nombre|Edad|     Ciudad|          Pais|EdadDuplicada|EdadDuplicadaMeses|EdadMeses|
+----------+----+-----------+--------------+-------------+------------------+---------+
|     Morie|  10|Los Angeles|Estados Unidos|           20|               240|      120|
|      Amie|  10|      Dixon|Estados Unidos|           20|               240|      120|
|   Charlie|  10|Los Angeles|Estados Unidos|           20|               240|      120|
|   Timothy|  12|    Chicago|Estados Unidos|           24|               288|      144|
|  Humfried|  13|    Chicago|Estados Unidos|           26|               312|      156|
|    Hayden|  13|    Chicago|Estados Unidos|           26|               312|      156|
|     Nerte|  13|   New York|Estados Unidos|           26|               312|      156|
|   Vanessa|  14|    Chicago|Estados Unidos|           28|               336|      168|
|     Linus|  15|   New York|Estados Unidos|           30|               360|      180|
|   Nickola|  15|      Dixon|Estados Unidos|           30|               360|      180|
|   Ibrahim|  15|   New York|Estados Unidos|           30|               360|      180|
|    Ashien|  17|    Chicago|Estados Unidos|           34|               408|      204|
|   Charlie|  18|   New York|Estados Unidos|           36|               432|      216|
|      Saxe|  18|   Arrowood|Estados Unidos|           36|               432|      216|
|Anestassia|  19|    Chicago|Estados Unidos|           38|               456|      228|
|   Vanessa|  21|   New York|Estados Unidos|           42|               504|      252|
|   Charlie|  22|    Chicago|Estados Unidos|           44|               528|      264|
|     Katha|  22|     Nevada|Estados Unidos|           44|               528|      264|
|  Shirline|  23|    Lillian|Estados Unidos|           46|               552|      276|
|  Tatiania|  24|   New York|Estados Unidos|           48|               576|      288|
+----------+----+-----------+--------------+-------------+------------------+---------+
only showing top 20 rows

# 16. Contar el número total de personas en el DataFrame.

In [20]:
data.rdd.count()

103

# 17. Filtrar personas cuya edad sea un número par.

In [21]:
data.filter((data.Edad % 2 == 0 )).show(60)

+----------+----+-------------+--------------+
|    Nombre|Edad|       Ciudad|          Pais|
+----------+----+-------------+--------------+
|   Charlie|  10|  Los Angeles|Estados Unidos|
|     Morie|  10|  Los Angeles|Estados Unidos|
|      Amie|  10|        Dixon|Estados Unidos|
|   Timothy|  12|      Chicago|Estados Unidos|
|   Vanessa|  14|      Chicago|Estados Unidos|
|   Charlie|  18|     New York|Estados Unidos|
|      Saxe|  18|     Arrowood|Estados Unidos|
|     Katha|  22|       Nevada|Estados Unidos|
|   Charlie|  22|      Chicago|Estados Unidos|
|  Tatiania|  24|     New York|Estados Unidos|
|   Charlie|  26|     New York|Estados Unidos|
|   Charita|  28|      Springs|Estados Unidos|
|       Bob|  30|  Los Angeles|Estados Unidos|
|Anestassia|  30|     New York|Estados Unidos|
|    Lainey|  30| Ronald Regan|Estados Unidos|
|     Hasty|  36|     New York|Estados Unidos|
|Willabella|  38|Weeping Birch|Estados Unidos|
| Cristobal|  40|      Chicago|Estados Unidos|
|     Vikky|  44|     New York|Estados Unidos|
|       Ara|  44|     New York|Estados Unidos|
|  Stephani|  46|        Dixon|Estados Unidos|
|    Desiri|  50|        Dixon|Estados Unidos|
|   Matilda|  50|  Los Angeles|Estados Unidos|
|     Ringo|  52|     New York|Estados Unidos|
|   Adolpho|  54|     New York|Estados Unidos|
|   Kristal|  54|     New York|Estados Unidos|
| Francesca|  54|        Dixon|Estados Unidos|
|       Cos|  58|  Los Angeles|Estados Unidos|
|       Bob|  60|        Chive|Estados Unidos|
|      Peri|  60|        Dixon|Estados Unidos|
|  Kathryne|  60|  Los Angeles|Estados Unidos|
|   Vanessa|  60|      Chicago|Estados Unidos|
|    Markus|  62|  Los Angeles|Estados Unidos|
|   Sherman|  62|  Los Angeles|Estados Unidos|
|   Agustin|  68|  Los Angeles|Estados Unidos|
|   Lizbeth|  68|Weeping Birch|Estados Unidos|
|    Kellen|  68|       Nevada|Estados Unidos|
|    Lulita|  68|  Los Angeles|Estados Unidos|
|   Charlie|  70|  Los Angeles|Estados Unidos|
|  Kendrick|  70|      Chicago|Estados Unidos|
|  Danyelle|  70|        Dixon|Estados Unidos|
|   Vanessa|  70|       Algoma|Estados Unidos|
|    Scotty|  72|     Wayridge|Estados Unidos|
|      Edee|  72|     New York|Estados Unidos|
|      Rena|  72|     New York|Estados Unidos|
|    Dehlia|  74|        Dixon|Estados Unidos|
|    Darryl|  74|  Los Angeles|Estados Unidos|
| Francklyn|  76|     Westport|Estados Unidos|
|     Tarra|  78|        Dixon|Estados Unidos|
|     Avram|  90|      Chicago|Estados Unidos|
|   Jillian|  90|      Chicago|Estados Unidos|
|     Leroy|  92|      Chicago|Estados Unidos|
|    Ashlee|  92|  Los Angeles|Estados Unidos|
|       Bob|  94|  Los Angeles|Estados Unidos|
|     Morie|  94|     New York|Estados Unidos|
|   Vanessa|  94|  Los Angeles|Estados Unidos|
|      Caro|  96|      Chicago|Estados Unidos|
|   Sybille|  98|     New York|Estados Unidos|
+----------+----+-------------+--------------+

# 18. Calcular la cantidad de personas por rango de edades (0-20, 21-40, 41-60, 61+).

In [22]:
@udf(returnType=StringType()) 
def rango_edad(edad):
    if (edad >0 and edad<=20):
        return '0-20'
    elif (edad >20 and edad<=40):
        return '21-40'
    elif (edad >40 and edad<=60):
        return '41-60'
    elif (edad>60):
        return '61+'

In [23]:
data_age_range = data.withColumn("RangoEdad", rango_edad(col("Edad")))
data_age_range.show(40)

+----------+----+-------------+--------------+---------+
|    Nombre|Edad|       Ciudad|          Pais|RangoEdad|
+----------+----+-------------+--------------+---------+
|     Morie|  10|  Los Angeles|Estados Unidos|     0-20|
|      Amie|  10|        Dixon|Estados Unidos|     0-20|
|   Charlie|  10|  Los Angeles|Estados Unidos|     0-20|
|   Timothy|  12|      Chicago|Estados Unidos|     0-20|
|  Humfried|  13|      Chicago|Estados Unidos|     0-20|
|    Hayden|  13|      Chicago|Estados Unidos|     0-20|
|     Nerte|  13|     New York|Estados Unidos|     0-20|
|   Vanessa|  14|      Chicago|Estados Unidos|     0-20|
|     Linus|  15|     New York|Estados Unidos|     0-20|
|   Nickola|  15|        Dixon|Estados Unidos|     0-20|
|   Ibrahim|  15|     New York|Estados Unidos|     0-20|
|    Ashien|  17|      Chicago|Estados Unidos|     0-20|
|   Charlie|  18|     New York|Estados Unidos|     0-20|
|      Saxe|  18|     Arrowood|Estados Unidos|     0-20|
|Anestassia|  19|      Chicago|Estados Unidos|     0-20|
|   Vanessa|  21|     New York|Estados Unidos|    21-40|
|   Charlie|  22|      Chicago|Estados Unidos|    21-40|
|     Katha|  22|       Nevada|Estados Unidos|    21-40|
|  Shirline|  23|      Lillian|Estados Unidos|    21-40|
|  Tatiania|  24|     New York|Estados Unidos|    21-40|
|     Alice|  25|     New York|Estados Unidos|    21-40|
|    Hedvig|  25|     New York|Estados Unidos|    21-40|
|   Charlie|  26|     New York|Estados Unidos|    21-40|
|   Emelina|  27|     New York|Estados Unidos|    21-40|
|   Cosetta|  27|      Chicago|Estados Unidos|    21-40|
|   Charita|  28|      Springs|Estados Unidos|    21-40|
|       Bob|  30|  Los Angeles|Estados Unidos|    21-40|
|Anestassia|  30|     New York|Estados Unidos|    21-40|
|    Lainey|  30| Ronald Regan|Estados Unidos|    21-40|
|   Vanessa|  31|  Los Angeles|Estados Unidos|    21-40|
|      Jenn|  31|  Los Angeles|Estados Unidos|    21-40|
|       Dot|  33|      Chicago|Estados Unidos|    21-40|
|    Shanie|  33|     New York|Estados Unidos|    21-40|
|  Gabriela|  35|      Chicago|Estados Unidos|    21-40|
|     Hasty|  36|     New York|Estados Unidos|    21-40|
|   Gasparo|  37|  Los Angeles|Estados Unidos|    21-40|
|Willabella|  38|Weeping Birch|Estados Unidos|    21-40|
|     Rhett|  39|     New York|Estados Unidos|    21-40|
|       Bob|  39|      Chicago|Estados Unidos|    21-40|
|     Fawne|  39|      Chicago|Estados Unidos|    21-40|
+----------+----+-------------+--------------+---------+
only showing top 40 rows

In [24]:
data_age_range.groupBy("RangoEdad").count().show()

+---------+-----+
|RangoEdad|count|
+---------+-----+
|      61+|   40|
|    21-40|   26|
|     0-20|   15|
|    41-60|   22|
+---------+-----+

# 19. Contar cuántas personas tienen el mismo nombre.

In [25]:
data.groupBy("Nombre").count().show(40)

+----------+-----+
|    Nombre|count|
+----------+-----+
|     Ringo|    1|
|     Linus|    1|
|   Charlie|    7|
|     Morie|    2|
|       Bob|    8|
|     Alice|    1|
|     Tarra|    1|
|     Rhett|    1|
|  Danyelle|    1|
|    Hedvig|    1|
|       Ara|    1|
|       Cos|    1|
|   Jillian|    1|
|   Sybille|    1|
|   Sherman|    1|
|    Lulita|    1|
|     Avram|    1|
|       Dot|    1|
|     Syman|    1|
|   Vanessa|    9|
|  Stephani|    1|
|   Agustin|    1|
|   Gasparo|    1|
|     Leroy|    1|
|     Katha|    1|
|  Tatiania|    1|
|    Elvina|    1|
|    Desiri|    1|
|      Livy|    1|
|   Suzette|    1|
|    Markus|    1|
|   Adolpho|    1|
|      Peri|    1|
|    Keslie|    1|
|    Shanie|    1|
|    Philis|    1|
|  Kendrick|    1|
|Anestassia|    2|
|    Ileana|    1|
| Francklyn|    1|
+----------+-----+
only showing top 40 rows

# 20. Concatenar las columnas "Nombre" y "Ciudad" en una nueva columna llamada "InformacionPersonal".

In [26]:
data_final = data.withColumn('InformacionPersonal', 
                    concat(col('Nombre'),lit(', '), concat(col('Ciudad'))))
data_final.show()

+----------+----+-----------+--------------+--------------------+
|    Nombre|Edad|     Ciudad|          Pais| InformacionPersonal|
+----------+----+-----------+--------------+--------------------+
|      Amie|  10|      Dixon|Estados Unidos|         Amie, Dixon|
|   Charlie|  10|Los Angeles|Estados Unidos|Charlie, Los Angeles|
|     Morie|  10|Los Angeles|Estados Unidos|  Morie, Los Angeles|
|   Timothy|  12|    Chicago|Estados Unidos|    Timothy, Chicago|
|    Hayden|  13|    Chicago|Estados Unidos|     Hayden, Chicago|
|  Humfried|  13|    Chicago|Estados Unidos|   Humfried, Chicago|
|     Nerte|  13|   New York|Estados Unidos|     Nerte, New York|
|   Vanessa|  14|    Chicago|Estados Unidos|    Vanessa, Chicago|
|     Linus|  15|   New York|Estados Unidos|     Linus, New York|
|   Nickola|  15|      Dixon|Estados Unidos|      Nickola, Dixon|
|   Ibrahim|  15|   New York|Estados Unidos|   Ibrahim, New York|
|    Ashien|  17|    Chicago|Estados Unidos|     Ashien, Chicago|
|      Saxe|  18|   Arrowood|Estados Unidos|      Saxe, Arrowood|
|   Charlie|  18|   New York|Estados Unidos|   Charlie, New York|
|Anestassia|  19|    Chicago|Estados Unidos| Anestassia, Chicago|
|   Vanessa|  21|   New York|Estados Unidos|   Vanessa, New York|
|   Charlie|  22|    Chicago|Estados Unidos|    Charlie, Chicago|
|     Katha|  22|     Nevada|Estados Unidos|       Katha, Nevada|
|  Shirline|  23|    Lillian|Estados Unidos|   Shirline, Lillian|
|  Tatiania|  24|   New York|Estados Unidos|  Tatiania, New York|
+----------+----+-----------+--------------+--------------------+
only showing top 20 rows